cat
kitten
feline
dog
puppy
canine
animal
pet
lion
tiger
bear
wolf
fox
deer
horse
sheep
goat
pig
cow
chicken
duck
goose
eagle
hawk
owl
shark
whale
dolphin
octopus
crab
spider
insect
ant
bee
butterfly
giraffe
elephant
zebra
camel
koala
kangaroo
panda
monkey
ape
chimpanzee
gorilla
lemur
raccoon
squirrel
rabbit
mouse
rat
hamster
hedgehog
bat
otter
seal
penguin
parrot
swan
turkey
peacock
flamingo
pelican
carp
salmon
trout
tuna
cod
jellyfish
seahorse
starfish
lizard
snake
crocodile
alligator
turtle
tortoise
frog
toad
newt
car
automobile
vehicle
truck
bus
train
plane
boat
bike
bicycle
scooter
motorcycle
subway
tram
rocket
spaceship
ferry
yacht
sailboat
canoe
kayak
van
taxi
cab
trolley
helicopter
glider
jet
airliner
cruiser
pickup
minivan
suv
skateboard
rollerblades
hoverboard
computer
laptop
keyboard
mouse
monitor
screen
software
hardware
code
coding
program
programming
developer
engineer
data
database
server
client
api
internet
web
website
browser
email
network
protocol
cloud
storage
cache
queue
algorithm
model
training
inference
dataset
pipeline
library
framework
package
module
function
process
thread
task
job
bug
issue
ticket
sprint
backlog
repository
repo
branch
commit
merge
pull
push
build
deploy
release
staging
production
dev
test
ci
cd
container
docker
kubernetes
k8s
microservice
monolith
endpoint
request
response
latency
throughput
bandwidth
socket
port
firewall
dns
http
https
tcp
udp
ssl
tls
json
xml
yaml
csv
markdown
html
css
javascript
typescript
python
ruby
java
kotlin
scala
go
rust
elixir
erlang
c
cpp
csharp
php
swift
objectivec
shell
bash
zsh
powershell
sql
nosql
postgres
mysql
sqlite
mongodb
redis
kafka
rabbitmq
nginx
apache
loadbalancer
autoscaling
metrics
logging
tracing
monitoring
alerting
dashboard
grafana
prometheus
datadog
newrelic
sentry
tree
forest
leaf
branch
root
flower
plant
grass
garden
nature
jungle
rainforest
swamp
meadow
prairie
wood
woodland
bush
shrub
seed
soil
cactus
moss
fern
vine
herb
blossom
bloom
pollen
bark
trunk
twig
sap
grove
orchard
water
ocean
river
lake
sea
stream
rain
snow
ice
fire
heat
burn
hot
cold
warm
cool
chill
thunder
lightning
rainbow
tornado
hurricane
blizzard
fog
mist
drizzle
hail
storm
weather
climate
tsunami
flood
drought
breeze
gale
wind
humidity
dew
frost
sleet
overcast
clear
cloudy
sunny
sun
moon
star
sky
cloud
sunrise
sunset
daylight
night
midnight
dawn
dusk
eclipse
galaxy
planet
comet
asteroid
meteor
constellation
orbit
happy
joy
glad
cheerful
smile
laugh
sad
unhappy
sorrow
cry
tear
angry
afraid
scared
nervous
anxious
calm
relaxed
bored
excited
surprised
tired
sleepy
hungry
thirsty
content
delighted
pleased
ecstatic
furious
upset
irritated
annoyed
frustrated
worried
hopeful
confident
ashamed
guilty
proud
jealous
envious
lonely
king
queen
prince
princess
royal
throne
crown
empire
kingdom
realm
leader
ruler
emperor
empress
lord
lady
duke
duchess
knight
noble
baron
baroness
count
countess
earl
viscount
squire
herald
regent
man
woman
boy
girl
father
mother
parent
child
adult
human
person
people
friend
family
baby
kid
teen
youth
elder
son
daughter
brother
sister
husband
wife
spouse
partner
uncle
aunt
cousin
grandparent
grandpa
grandma
colleague
coworker
neighbor
stranger
good
great
excellent
fine
nice
bad
poor
terrible
awful
worse
worst
better
best
average
fair
mediocre
superb
horrible
fast
quick
rapid
slow
speed
swift
sluggish
delay
late
early
ontime
punctual
timely
accelerate
decelerate
hurry
rush
haste
lag
big
large
huge
giant
small
tiny
little
minute
short
long
tall
high
low
wide
narrow
deep
shallow
thick
thin
heavy
light
massive
colossal
petite
slender
bulky
hefty
red
blue
green
yellow
orange
purple
pink
black
white
gray
brown
cyan
magenta
teal
turquoise
beige
maroon
navy
violet
indigo
gold
silver
bronze
lavender
lilac
coral
peach
olive
lime
mustard
charcoal
city
town
village
country
nation
state
capital
road
street
avenue
lane
highway
freeway
bridge
tunnel
port
harbor
downtown
suburb
rural
urban
plaza
square
park
market
station
airport
terminal
campus
stadium
arena
theater
place
location
area
region
zone
district
center
middle
corner
edge
border
coast
shore
beach
island
mountain
hill
valley
desert
canyon
glacier
volcano
plain
plateau
ridge
peak
cliff
dune
cove
bay
gulf
peninsula
cape
house
home
apartment
room
kitchen
bathroom
bedroom
living
dining
garage
window
door
floor
ceiling
wall
roof
table
chair
sofa
bed
desk
lamp
light
fan
clock
phone
hallway
balcony
porch
patio
garden
yard
fence
gate
closet
cupboard
cabinet
drawer
shelf
mirror
carpet
rug
curtain
mattress
pillow
blanket
sheet
fridge
freezer
oven
stove
microwave
kettle
toaster
sink
faucet
shower
bathtub
toilet
towel
soap
music
song
melody
rhythm
harmony
sound
noise
art
paint
draw
picture
image
photo
film
movie
cinema
theater
museum
gallery
dance
sculpture
opera
symphony
concerto
guitar
piano
violin
drum
trumpet
saxophone
flute
chorus
singer
band
album
track
playlist
book
read
write
story
poem
novel
paper
page
letter
word
sentence
paragraph
chapter
author
title
library
publish
print
magazine
journal
article
essay
editor
publisher
manuscript
bookmark
index
glossary
food
eat
drink
bread
rice
meat
beef
pork
chicken
fish
seafood
fruit
vegetable
sugar
salt
spice
pepper
herb
oil
butter
cheese
milk
egg
yogurt
cereal
chocolate
candy
cookie
cake
pie
soup
salad
pizza
pasta
burger
sandwich
noodles
ramen
sushi
taco
burrito
curry
stew
bbq
roast
grill
bake
fry
boil
steam
chili
sauce
ketchup
mustard
mayo
vinegar
garlic
onion
tomato
potato
carrot
lettuce
cucumber
pepperoni
sausage
bacon
ham
lamb
tofu
bean
lentil
chickpea
corn
avocado
banana
apple
orange
lemon
lime
grape
berry
strawberry
blueberry
raspberry
pineapple
mango
peach
pear
plum
watermelon
melon
coconut
olive
fig
date
raisin
walnut
almond
peanut
cashew
pistachio
hazelnut
pecan
beverage
coffee
tea
juice
soda
water
beer
wine
whiskey
vodka
rum
milkshake
cocktail
latte
espresso
cappuccino
mocha
americano
lemonade
smoothie
cider
stout
lager
ale
champagne
school
student
teacher
class
lesson
study
learn
education
university
college
campus
lecture
exam
test
grade
homework
assignment
quiz
course
syllabus
textbook
diploma
degree
scholarship
semester
trimester
health
medicine
hospital
clinic
doctor
nurse
pill
drug
vaccine
therapy
pain
fever
cough
flu
disease
virus
bacteria
injury
wound
symptom
diagnosis
treatment
surgery
operation
recovery
fracture
allergy
asthma
cancer
diabetes
infection
antibiotic
antiseptic
prescription
appointment
sport
soccer
football
baseball
basketball
tennis
golf
hockey
volleyball
rugby
cricket
swim
run
walk
jump
climb
lift
throw
catch
kick
hit
score
team
coach
referee
player
athlete
match
game
tournament
league
championship
practice
training
gym
race
marathon
sprint
yoga
cycling
skating
surfing
skiing
snowboarding
hiking
boxing
wrestling
karate
judo
taekwondo
clothing
shirt
pants
jeans
dress
skirt
coat
jacket
hat
cap
shoe
boot
sock
glove
scarf
belt
sweater
hoodie
t-shirt
blouse
shorts
swimsuit
underwear
bra
tie
bowtie
suit
tuxedo
pajamas
robe
raincoat
umbrella
sunglasses
watch
ring
necklace
bracelet
earrings
tools
hammer
screw
screwdriver
wrench
pliers
saw
drill
nail
bolt
ladder
shovel
axe
knife
tape
measure
level
chisel
sandpaper
file
clamp
vise
sander
plane
router
bit
socket
ratchet
mallet
crowbar
body
head
face
hair
eye
ear
nose
mouth
tooth
teeth
tongue
hand
arm
leg
foot
feet
heart
brain
stomach
back
skin
bone
chest
shoulder
elbow
wrist
finger
thumb
hip
knee
ankle
toe
liver
kidney
lung
blood
muscle
nerve
finance
money
bank
cash
coin
credit
debit
card
loan
interest
tax
price
cost
buy
sell
trade
market
stock
bond
budget
income
expense
pay
salary
wage
bill
profit
loss
revenue
margin
invoice
receipt
ledger
balance
savings
checking
mortgage
insurance
premium
claim
investment
portfolio
dividend
inflation
deflation
recession
time
date
day
week
month
year
morning
evening
night
today
tomorrow
yesterday
spring
summer
autumn
winter
january
february
march
april
may
june
july
august
september
october
november
december
calendar
schedule
deadline
appointment
moment
instant
hour
minute
second
noon
afternoon
midnight
weekend
weekday
holiday
numbers
zero
one
two
three
four
five
six
seven
eight
nine
ten
hundred
thousand
million
billion
dozen
couple
pair
score
directions
north
south
east
west
left
right
up
down
forward
backward
inside
outside
near
far
toward
away
across
along
around
through
over
under
beneath
above
below
between
among
circle
square
triangle
rectangle
line
point
curve
angle
edge
corner
center
middle
polygon
hexagon
pentagon
octagon
sphere
cube
cylinder
cone
pyramid
prism
be
have
do
say
make
go
know
think
take
see
come
want
use
find
give
tell
work
call
try
ask
need
feel
seem
leave
put
keep
let
begin
help
talk
turn
start
show
hear
play
move
like
live
believe
hold
bring
happen
write
provide
sit
stand
lose
pay
meet
include
continue
set
learn
change
lead
understand
watch
follow
stop
create
speak
read
allow
add
spend
grow
open
walk
win
offer
remember
love
consider
appear
buy
wait
serve
die
send
expect
build
stay
fall
cut
reach
kill
remain
suggest
raise
pass
sell
require
report
decide
return
explain
hope
develop
carry
break
receive
agree
support
hit
produce
eat
drink
sleep
drive
ride
fly
swim
hotel
hostel
inn
motel
resort
campsite
campground
cabin
booking
reservation
ticket
passport
visa
luggage
suitcase
backpack
map
guide
tour
tourism
traveler
tourist
office
meeting
conference
presentation
report
document
memo
note
project
manager
director
executive
hr
finance
accounting
sales
marketing
support
operations
legal
compliance
strategy
roadmap
energy
power
battery
charge
electricity
fuel
gas
diesel
solar
wind
nuclear
hydrogen
